import { Typography } from "@/shared/components/typography/Typography";

export const Agreement = () => {
  return (
    <div>
      <Typography variant="default" tag={"p"}>
        Каждый человек сообщает свои Ф.И.О., реквизиты паспорта, адрес,
        информацию о здоровье и т.п. множеству организаций. В большинстве
        случаев на обработку данных нужно согласие физлица. Разберемся, что это
        такое, в какой форме его можно дать, как происходит получение согласия.
        1. Что такое согласие на обработку персональных данных и когда оно нужно
        Согласие на обработку персональных данных — это ваше разрешение
        совершать с персональными данными любые действия. Например, собирать
        данные, хранить их, изменять, использовать, распространять, удалять
        (абз. 6 ст. 1, п. 1 ст. 5 Закона о защите персональных данных).
        
        Согласие может быть дано в одной из следующих форм (п. 2 ст. 5 Закона о защите
        персональных данных): 1) в письменной форме, т.е. вы подпишете
        «бумажный» документ, в котором выражено ваше согласие на обработку
        персональных данных; 2) в форме электронного документа. Такой документ
        создают с помощью специальных программ. Подписать его можно только
        электронной цифровой подписью, если она у вас есть (ст. 16, 17 Закона об
        электронном документе и ЭЦП); 3) в другой электронной форме. Такое
        согласие вы можете дать (п. 3 ст. 5 Закона о защите персональных
        данных): — путем введения кода, полученного в СМС-сообщении или в письме
        на электронную почту.
      </Typography>
    </div>
  );
};
